translation = {
    "proxy_switch_alert": (
        "# ⚠️ Proxy Switch Alert\n"
        "---\n\n"
        "### ⚠️ [Proxy Monitor] Основной прокси не отвечает!\n\n"
        "🔄 Бот автоматически переключился на резервное SOCKS5 подключение.\n\n"
        "| Параметр | Значение |\n"
        "| :--- | :--- |\n"
        "| **❌ Основной прокси** | `{primary_proxy}` |\n"
        "| **🔄 Резервный прокси** | `{new_proxy}` |\n"
    ),
    "proxy_restored_alert": (
        "# ✅ Proxy Restored\n"
        "---\n\n"
        "### ✅ [Proxy Monitor] Основной прокси снова доступен!\n\n"
        "🔄 Успешно вернулись на основное подключение.\n\n"
        "| Параметр | Значение |\n"
        "| :--- | :--- |\n"
        "| **🔌 Подключение** | `{primary_proxy}` |\n"
        "| **ℹ️ Статус** | 🟢 В сети (Основной прокси) |\n"
    )
}
